ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/CommonModules/МенеджерРегистрации/Module.bsl
Функция vs_ОтборПоСвойствамОбъекта_6()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // begin fix Suetin 09.10.2020 4:58:06<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПроведеноБанком</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПроведеноБанком</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>// end fix Suetin 09.10.2020 4:58:49 -->
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция vs_ОтборПоСвойствамОбъекта_1()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>НомерПоДаннымКлиента</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты></ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>НомерПоДаннымКлиента</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|	</ОтборПоСвойствамОбъекта>
			|";
КонецФункции

Функция vs_ОтборПоСвойствамОбъекта_1_Документ_ПередачаМатериаловВПроизводство()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<!-- <ЗначениеКонстанты>true</ЗначениеКонстанты>// fix Designer27.10.2020 14:37:25 -->
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!--  // fix Designer27.10.2020 14:37:25 -->
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ИТБК_ТехническийДокумент</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Технический документ (vssoft)</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!--  // fix Designer27.10.2020 14:37:25 -->
			|</ОтборПоСвойствамОбъекта>
			|";
КонецФункции

Функция vs_ОтборПоСвойствамПланаОбмена_2_Документ_ВнутреннееПотребление()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<!-- //////////////////////////////////////// -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>ПланВидовХарактеристикСсылка.СтатьиРасходов</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[vs_СтатьиРасходов].vs_СтатьяРасходов</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>vs_СтатьяРасходов</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>vs_СтатьяРасходов</Наименование>
			|				<Тип>ПланВидовХарактеристикСсылка.СтатьиРасходов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[vs_СтатьиРасходов]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>vs_СтатьяРасходов</Наименование>
			|				<Тип>ПланВидовХарактеристикСсылка.СтатьиРасходов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<!-- //////////////////////////////////////// -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<Группа>
			|				<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>УправленческаяОрганизация</СвойствоПланаОбмена>
			|					<ВидСравнения>НеРавно</ВидСравнения>
			|					<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|					<ТаблицаСвойствОбъекта>
			|						<Свойство>
			|							<Наименование>Организация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>УправленческаяОрганизация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>ВыгружатьУправленческуюОрганизацию</СвойствоПланаОбмена>
			|					<ВидСравнения>Равно</ВидСравнения>
			|					<СвойствоОбъекта>true</СвойствоОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>ВыгружатьУправленческуюОрганизацию</Наименование>
			|							<Тип>Булево</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|			</Группа>
			|		</Группа>
			|	</Группа>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Склады</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Склады].Склад</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Склад</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Склады]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоСкладам</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоСкладам</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУП2ЗУП3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменКасса</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУПРМК</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_Документ_СписаниеБезналичныхДенежныхСредств")
Процедура vs_ДобавитьПРО_Документ_СписаниеБезналичныхДенежныхСредств(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_СписаниеБезналичныхДенежныхСредств";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.СписаниеБезналичныхДенежныхСредств";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
#Удаление
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамПланаОбмена(),
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамОбъекта());
#КонецУдаления
#Вставка
	// fix Suetin 1/12/2024 3:02:21 AM	ПроведеноБанком любое состояние
		//ОтборПоСвойствамОбъекта_6());
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамПланаОбмена(),
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамОбъекта());
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПРО_Документ_ЗаказКлиента")
Процедура vs_ДобавитьПРО_Документ_ЗаказКлиента(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ЗаказКлиента";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ЗаказКлиента";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ЗаказКлиента_ОтборПоСвойствамПланаОбмена(),
#Удаление
		ОтборПоСвойствамОбъекта_4());
#КонецУдаления
#Вставка
		// fix Suetin 1/12/2024 3:02:21 AM	НомерПоДаннымКлиента должен быть заполнен
		vs_ОтборПоСвойствамОбъекта_5());

#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("Документ_ДвижениеПродукцииИМатериалов_ОтборПоСвойствамОбъекта")
Функция vs_Документ_ДвижениеПродукцииИМатериалов_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
#Удаление
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
#КонецУдаления
#Вставка
	|		<!-- // fix Designer09.10.2020 15:36:19<ЗначениеКонстанты>true</ЗначениеКонстанты> -->
	|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
#КонецВставки
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ХозяйственныеОперации</ТипСвойстваОбъекта>
#Удаление
			|		<ВидСравнения>НеРавно</ВидСравнения>
#КонецУдаления
#Вставка	
	|		<!-- // fix Designer09.10.2020 15:36:19<ВидСравнения>НеРавно</ВидСравнения> -->
	|		<ВидСравнения>Равно</ВидСравнения>
#КонецВставки	
			|		<СвойствоОбъекта>ХозяйственнаяОперация</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
#Удаление	
			|		<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов;</ЗначениеКонстанты>
#КонецУдаления
#Вставка	
	|		<!-- // fix Designer09.10.2020 15:36:19<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов;</ЗначениеКонстанты> -->
	|		<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;</ЗначениеКонстанты>
#КонецВставки	
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ХозяйственнаяОперация</Наименование>
			|				<Тип>ПеречислениеСсылка.ХозяйственныеОперации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
#Удаление	
			|	<ЭлементОтбора>
#КонецУдаления
#Вставка	
	|		<!-- // fix Designer09.10.2020 15:36:19<ЭлементОтбора>
#КонецВставки	
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.СтатусыДвиженияПродукцииИМатериалов</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Статус</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Статус</Наименование>
			|				<Тип>ПеречислениеСсылка.СтатусыДвиженияПродукцииИМатериалов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
#Удаление	
			|	</ЭлементОтбора>
#КонецУдаления
#Вставка	
	|	</ЭлементОтбора> -->
#КонецВставки	
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВнутренняяПереработка</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВнутренняяПереработка</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_Документ_ПередачаМатериаловВПроизводство")
Процедура vs_ДобавитьПРО_Документ_ПередачаМатериаловВПроизводство(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ПередачаМатериаловВПроизводство";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ПередачаМатериаловВПроизводство";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ПередачаМатериаловВПроизводство_ОтборПоСвойствамПланаОбмена(),
#Удаление
		ОтборПоСвойствамОбъекта_4());
#КонецУдаления
#Вставка
// проверить!!!
		//ОтборПоСвойствамОбъекта_5());
		vs_ОтборПоСвойствамОбъекта_1_Документ_ПередачаМатериаловВПроизводство());
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПРО_Документ_ВнутреннееПотребление")
Процедура vs_ДобавитьПРО_Документ_ВнутреннееПотребление(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВнутреннееПотребление";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВнутреннееПотребление";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
#Удаление
		ОтборПоСвойствамПланаОбмена_16(),
#КонецУдаления
#Вставка
// Проверить!!! было ОтборПоСвойствамПланаОбмена_17(),
		vs_ОтборПоСвойствамПланаОбмена_2_Документ_ВнутреннееПотребление(),
#КонецВставки
		Документ_ВнутреннееПотребление_ОтборПоСвойствамОбъекта());
КонецПроцедуры

&ИзменениеИКонтроль("Документ_ВнутреннееПотребление_ОтборПоСвойствамОбъекта")
Функция vs_Документ_ВнутреннееПотребление_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
	|	<ЭлементОтбора>
	|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
	|		<ВидСравнения>Равно</ВидСравнения>
	|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
	|		<Вид>ЗначениеКонстанты</Вид>
	|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
	|		<ТаблицаСвойствОбъекта>
	|			<Свойство>
	|				<Наименование>Проведен</Наименование>
	|				<Тип>Булево</Тип>
	|				<Вид>Свойство</Вид>
	|			</Свойство>
	|		</ТаблицаСвойствОбъекта>
	|	</ЭлементОтбора>
#Вставка
    |
	|	<!--  // fix Designer27.10.2020 14:37:25 -->
	|	<ЭлементОтбора>
	|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
	|		<ВидСравнения>Равно</ВидСравнения>
	|		<СвойствоОбъекта>ИТБК_ЭтоДоизготовление</СвойствоОбъекта>
	|		<Вид>ЗначениеКонстанты</Вид>
	|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
	|		<ТаблицаСвойствОбъекта>
	|			<Свойство>
	|				<Наименование>Документ доизготовления (vssoft)</Наименование>
	|				<Тип>Булево</Тип>
	|				<Вид>Свойство</Вид>
	|			</Свойство>
	|		</ТаблицаСвойствОбъекта>
	|	</ЭлементОтбора>
	|	<!--  // fix Designer27.10.2020 14:37:25 -->
#КонецВставки
	|	<Группа>
	|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
	|		<ЭлементОтбора>
	|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ХозяйственныеОперации</ТипСвойстваОбъекта>
	|			<ВидСравнения>Равно</ВидСравнения>
	|			<СвойствоОбъекта>ХозяйственнаяОперация</СвойствоОбъекта>
	|			<Вид>АлгоритмЗначения</Вид>
	|			<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;</ЗначениеКонстанты>
	|			<ТаблицаСвойствОбъекта>
	|				<Свойство>
	|					<Наименование>ХозяйственнаяОперация</Наименование>
	|					<Тип>ПеречислениеСсылка.ХозяйственныеОперации</Тип>
	|					<Вид>Реквизит</Вид>
	|				</Свойство>
	|			</ТаблицаСвойствОбъекта>
	|		</ЭлементОтбора>
	|		<ЭлементОтбора>
	|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ХозяйственныеОперации</ТипСвойстваОбъекта>
	|			<ВидСравнения>Равно</ВидСравнения>
	|			<СвойствоОбъекта>ХозяйственнаяОперация</СвойствоОбъекта>
	|			<Вид>АлгоритмЗначения</Вид>
	|			<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию;</ЗначениеКонстанты>
	|			<ТаблицаСвойствОбъекта>
	|				<Свойство>
	|					<Наименование>ХозяйственнаяОперация</Наименование>
	|					<Тип>ПеречислениеСсылка.ХозяйственныеОперации</Тип>
	|					<Вид>Реквизит</Вид>
	|				</Свойство>
	|			</ТаблицаСвойствОбъекта>
	|		</ЭлементОтбора>
	|	</Группа>
	|</ОтборПоСвойствамОбъекта>";
КонецФункции

Функция vs_ОтборПоСвойствамПланаОбмена_2_Документ_СборкаТоваров()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<Группа>
			|				<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>УправленческаяОрганизация</СвойствоПланаОбмена>
			|					<ВидСравнения>НеРавно</ВидСравнения>
			|					<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|					<ТаблицаСвойствОбъекта>
			|						<Свойство>
			|							<Наименование>Организация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>УправленческаяОрганизация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>ВыгружатьУправленческуюОрганизацию</СвойствоПланаОбмена>
			|					<ВидСравнения>Равно</ВидСравнения>
			|					<СвойствоОбъекта>true</СвойствоОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>ВыгружатьУправленческуюОрганизацию</Наименование>
			|							<Тип>Булево</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|			</Группа>
			|		</Группа>
			|	</Группа>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Склады</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Склады].Склад</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Склад</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Склады]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоСкладам</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоСкладам</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУП2ЗУП3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменКасса</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУПРМК</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			
			|	<!--       // begin fix Designer 2025.12.10 -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Справочник.ВидыНоменклатуры</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[vs_ВидыНоменклатуры].vs_ВидНоменклатуры</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Номенклатура.ВидНоменклатуры</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Номенклатура</Наименование>
			|				<Тип>Справочник.Номенклатура</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ВидНоменклатуры</Наименование>
			|				<Тип>Справочник.ВидыНоменклатуры</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[vs_ВидыНоменклатуры]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>vs_ВидНоменклатуры</Наименование>
			|				<Тип>Справочник.ВидыНоменклатуры</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<!--       // end fix Designer 2025.12.10 -->
			
			|</ОтборПоСвойствамПланаОбмена>" ;
	        А="
			|	</ЭлементОтбора>
			|	<!--       // begin fix Designer02.11.2020 12:45:50 -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУниверсальный</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<!--       // end fix Designer02.11.2020 12:46:13 -->
			|</ОтборПоСвойствамПланаОбмена>" ;
	
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_Документ_СборкаТоваров")
Процедура vs_ДобавитьПРО_Документ_СборкаТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_СборкаТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.СборкаТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
#Удаление
		ОтборПоСвойствамПланаОбмена_16(),
#КонецУдаления
#Вставка
//// Проверить!!!	 ОтборПоСвойствамПланаОбмена_17(), 15
		vs_ОтборПоСвойствамПланаОбмена_2_Документ_СборкаТоваров(),
#КонецВставки
		Документ_СборкаТоваров_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция vs_ОтборПоСвойствамОбъекта_5()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>НомерПоДаннымКлиента</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты></ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>НомерПоДаннымКлиента</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_РегистрСведений_СостоянияПоОбъектамУчетаЭДО")
Процедура vs_ДобавитьПРО_РегистрСведений_СостоянияПоОбъектамУчетаЭДО(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();

	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_СостоянияПоОбъектамУчетаЭДО";

	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.СостоянияПоОбъектамУчетаЭДО";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
#Удаление
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
#КонецУдаления
#Вставка
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";
	//НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
#КонецВставки
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;

	УстановитьОтборы(НовоеПравило, 
	РегистрСведений_СостоянияПоОбъектамУчетаЭДО_ОтборПоСвойствамПланаОбмена(),
	ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры
